app/views/dashboard/index.html.erb

        <div class="row">
          <% current_user.courses.each do |course| %>
---
SELECT "courses".* FROM "courses" INNER JOIN "memberships" ON "courses"."id" = "memberships"."course_id" WHERE "memberships"."user_id" = 1