app/views/students/index.html.erb

SELECT "students".* FROM "students"
---
    <h1>Directory</h1>
    <%= form_with url: students_path, method: :get, data: { turbo_frame: "students", controller: "search", action: "input->search#search" } do |f| %>