app/controllers/courses_controller.rb

  def index
    @courses = Course.all
---
SELECT "courses".* FROM "courses"

    def set_course
      @course = Course.find(params.expect(:id))
---
SELECT "courses".* FROM "courses" WHERE "courses"."id" = 1 LIMIT 1