app/controllers/students_controller.rb

    def index
      @courses = Course.includes(:students).all
---
SELECT "courses".* FROM "courses"
SELECT "students".* FROM "students" WHERE "students"."id" IN (1, 2, 3, 4, 5, 6)

    def create
      @student = Student.new(student_params)

      respond_to do |format|
        if @student.save
---
INSERT INTO "students" ("first_name", "last_name", "course", "profile_picture", "created_at", "updated_at") VALUES ('Tom', 'Foyer', 'CS 919', NULL, '2025-05-01 14:43:07.551610', '2025-05-01 14:43:07.551610') RETURNING "id"

    def update
      respond_to do |format|
        if @student.update(student_params)
---
UPDATE "students" SET "first_name" = 'ddd', "updated_at" = '2025-05-01 14:42:46.680732' WHERE "students"."id" = 15

      def load_courses
        @courses = Student.distinct.pluck(:course)
---
SELECT DISTINCT "students"."course" FROM "students"

      def set_student
        @student = Student.find(params[:id])
---
SELECT "students".* FROM "students" WHERE "students"."id" = 15 LIMIT 1